In [25]:
#Ans1:
import pandas as pd
a=pd.Series([4,8,15,16,23,42])
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [27]:
#Ans2:
list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(list)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [51]:
#Ans3: 
df=pd.DataFrame({"Name": ["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [39]:
#Ans4: DataFrame and Series are two fundamental data structures used for data manipulation and analysis
#Differences
#a.Series are one-dimensional while DataFrame are two-dimensional.
#b.Series are single column of data while DataFrame are multiple columns of data.
#c.Series are Single index while DataFrame are both row and column indices.
#example-
print("Series:",series,"\nDataframe:",df)

Series: 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
Dataframe:      Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [43]:
#Ans5:
#a.head(): Displays the first few rows of the DataFrame.
#example-
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [45]:
#b.tail(): Displays the last few rows of the DataFrame.
#example-
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [55]:
#c.drop(): Removes rows or columns.
#example-
df.drop('Gender', axis=1, inplace=True)
df

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [57]:
#d.filter():Filters data based on criteria.
#example-
df.filter(like='keyword')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [59]:
#Ans6:Series and DataFrame are mutable, while Panel is deprecated.

In [63]:
#Ans7:
name = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age = pd.Series([30, 25, 35, 40])
city = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Miami'])
df_2 = pd.DataFrame({
    'Names': name,
    'Ages': age,
    'Cities': city
})
df_2

     Names  Ages       Cities
0    Alice    30     New York
1      Bob    25  Los Angeles
2  Charlie    35      Chicago
3    David    40        Miami